# Используем официальный образ Python как базовый
# Изменено на 3.11-slim-buster, так как 3.12-slim-buster не найден.
# 3.11-slim-buster - это стабильный и широко доступный вариант.
FROM python:3.11-slim-buster

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл requirements.txt в рабочую директорию контейнера
COPY requirements.txt .

# Устанавливаем все зависимости, указанные в requirements.txt
# --no-cache-dir уменьшает размер образа, удаляя кэш pip
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код вашего бота в рабочую директорию контейнера
# Предполагается, что ваш основной файл бота называется `main.py`
COPY . .

# Эти переменные окружения используются для "фиктивных" значений во время сборки образа.
# Реальные значения будут передаваться при запуске контейнера.
ENV SAFETRADE_API_KEY="dummy" \
    SAFETRADE_API_SECRET="dummy" \
    TELEGRAM_BOT_TOKEN="dummy" \
    ADMIN_CHAT_ID="dummy"

# Команда для запуска приложения
# Основано на логах вашего развертывания, где указано 'main.py'
CMD ["python", "main.py"]
