# Используем официальный образ Python как базовый
# Рекомендуется использовать slim-buster для уменьшения размера образа
FROM python:3.12-slim-buster

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл requirements.txt в рабочую директорию контейнера
COPY requirements.txt .

# Устанавливаем все зависимости, указанные в requirements.txt
# --no-cache-dir уменьшает размер образа, удаляя кэш pip
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код вашего бота в рабочую директорию контейнера
# Убедитесь, что ваш основной файл бота называется `bot.py`
COPY . .

# Проверяем, что переменные окружения для API ключей установлены
# (они будут передаваться при запуске контейнера, не в самом образе)
ENV SAFETRADE_API_KEY="dummy" \
    SAFETRADE_API_SECRET="dummy" \
    TELEGRAM_BOT_TOKEN="dummy" \
    ADMIN_CHAT_ID="dummy"

# Команда для запуска приложения
# Предполагается, что ваш основной файл называется bot.py
# Замените 'bot.py' на фактическое имя вашего файла, если оно другое.
CMD ["python", "main.py"]
